[{"data":1,"prerenderedAt":354},["Reactive",2],{"content-query-OuAqizht3p":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"_empty":6,"title":7,"description":8,"body":9,"_type":349,"_id":350,"_source":351,"_file":352,"_extension":353},"/prototypingprocess","",false,"Prototyping Process","Prototyping is an important process when it comes to creating your own game. There are various directions and methods to build a prototype, including digital and non-digital practices. If you are interested in non-digital methods, you can follow this link and get inspiration for your own level design technique. There's also a collection of different digital tools that can all be helpful for creating your levels. In the following though, we would like to introduce an example by Alex K. of level prototyping that uses both non-digital and digital methods to guide you through the whole process and all the various iterations of the steps. Whether you want to get inspiration for your own individual approach or follow this example is, of course, totally up to your preference.",{"type":10,"children":11,"toc":336},"root",[12,20,58,65,70,75,80,85,91,159,164,169,188,194,199,212,217,223,228,233,238,251,256,261,273,279,284,289,295,300,305,310,316,321,326,331],{"type":13,"tag":14,"props":15,"children":17},"element","h1",{"id":16},"prototyping-process",[18],{"type":19,"value":7},"text",{"type":13,"tag":21,"props":22,"children":23},"p",{},[24,26,32,34,39,41,48,50,56],{"type":19,"value":25},"Prototyping is an important process when it comes to creating your own game. There are various directions and methods to build a prototype, including ",{"type":13,"tag":27,"props":28,"children":29},"strong",{},[30],{"type":19,"value":31},"digital",{"type":19,"value":33}," and ",{"type":13,"tag":27,"props":35,"children":36},{},[37],{"type":19,"value":38},"non-digital",{"type":19,"value":40}," practices. If you are interested in non-digital methods, you can follow ",{"type":13,"tag":42,"props":43,"children":45},"a",{"href":44},"/nondigitaltools",[46],{"type":19,"value":47},"this",{"type":19,"value":49}," link and get inspiration for your own level design technique. There's also a collection of different ",{"type":13,"tag":42,"props":51,"children":53},{"href":52},"/digitaltools",[54],{"type":19,"value":55},"digital tools",{"type":19,"value":57}," that can all be helpful for creating your levels. In the following though, we would like to introduce an example by Alex K. of level prototyping that uses both non-digital and digital methods to guide you through the whole process and all the various iterations of the steps. Whether you want to get inspiration for your own individual approach or follow this example is, of course, totally up to your preference.",{"type":13,"tag":59,"props":60,"children":62},"h2",{"id":61},"why-the-process-described-by-alex-k",[63],{"type":19,"value":64},"Why the process described by Alex K.?",{"type":13,"tag":21,"props":66,"children":67},{},[68],{"type":19,"value":69},"\"A common mistake many new designers make is to assume that gameplay cannot be tested until there is art to put into the engine.\" (Totten, 2019, p.17)",{"type":13,"tag":21,"props":71,"children":72},{},[73],{"type":19,"value":74},"Like Totten said, putting one step after the other can sometimes be very hindering once it slows down the process of creation and creativity. Instead, with prototyping one can find and prevent early mistakes, logic holes and misleading game mechanics while also providing an early, playable version and overall vision of the game.",{"type":13,"tag":21,"props":76,"children":77},{},[78],{"type":19,"value":79},"Alex K. defined their own approach of prototyping and used both digital and non-digital tools to methodically map out how the level should work and look like. As they said themselves:\r\n\"The eagerness to just jump into the engine and start blocking out a level can often be felt at this stage. While tempting, it’s typically a good idea to plan the level out a bit more and map it out beforehand. Everyone’s process is different, but the one I’m going to describe is one I feel should work for most people.\"  (Alex K. @TychoBolt, 2020, p.9)",{"type":13,"tag":21,"props":81,"children":82},{},[83],{"type":19,"value":84},"At this point we should be aware that this is not a process set in stone and certainly not everyone can identify themselves with this approach. But the generality of this process makes it usable in many ways and it can be seen as a good way to start building your level. There are several steps that can be followed in order and some steps that are iterated to further develop your level.",{"type":13,"tag":59,"props":86,"children":88},{"id":87},"process-steps",[89],{"type":19,"value":90},"Process Steps",{"type":13,"tag":92,"props":93,"children":94},"ol",{},[95,105,114,123,132,141,150],{"type":13,"tag":96,"props":97,"children":98},"li",{},[99],{"type":13,"tag":42,"props":100,"children":102},{"href":101},"#understand-what-you-want-to-create",[103],{"type":19,"value":104},"Understand what you want to create",{"type":13,"tag":96,"props":106,"children":107},{},[108],{"type":13,"tag":42,"props":109,"children":111},{"href":110},"#create-diagrams-and-flowcharts",[112],{"type":19,"value":113},"Create diagrams and flowcharts",{"type":13,"tag":96,"props":115,"children":116},{},[117],{"type":13,"tag":42,"props":118,"children":120},{"href":119},"#draw-a-map",[121],{"type":19,"value":122},"Draw a map",{"type":13,"tag":96,"props":124,"children":125},{},[126],{"type":13,"tag":42,"props":127,"children":129},{"href":128},"#get-a-sense-of-space",[130],{"type":19,"value":131},"Get a Sense of Space",{"type":13,"tag":96,"props":133,"children":134},{},[135],{"type":13,"tag":42,"props":136,"children":138},{"href":137},"#iterate-on-the-map",[139],{"type":19,"value":140},"Iterate on the Map",{"type":13,"tag":96,"props":142,"children":143},{},[144],{"type":13,"tag":42,"props":145,"children":147},{"href":146},"#start-with-blockout",[148],{"type":19,"value":149},"Blockout",{"type":13,"tag":96,"props":151,"children":152},{},[153],{"type":13,"tag":42,"props":154,"children":156},{"href":155},"#iterate-over-the-last-steps-and-create-a-final-level",[157],{"type":19,"value":158},"Iterate",{"type":13,"tag":59,"props":160,"children":162},{"id":161},"understand-what-you-want-to-create",[163],{"type":19,"value":104},{"type":13,"tag":21,"props":165,"children":166},{},[167],{"type":19,"value":168},"First, you want to think about what it is you want to create. What are your design goals? Which statements would you like to set in your levels? Which impressions would you like to make on the player? Make sure you're on the same page with your team and have a shared vision regarding the design of the level and how it contributes to the game. Some tools and methods for this step are:",{"type":13,"tag":170,"props":171,"children":172},"ul",{},[173,178,183],{"type":13,"tag":96,"props":174,"children":175},{},[176],{"type":19,"value":177},"Write down Design statements (that you can create and compare with your team). These can also be written down into and compared with the already established design goals in your documentation (link).",{"type":13,"tag":96,"props":179,"children":180},{},[181],{"type":19,"value":182},"Sketches and Drawings if you're already certain about the view and artistic impression you want to convey. You can add these artifacts to your documentation or save them in a location where you and your team can always refer back to.",{"type":13,"tag":96,"props":184,"children":185},{},[186],{"type":19,"value":187},"Reference collections and Moodboards that can be used to catch the atmosphere of a level and help the team to communicate their vision to each other.",{"type":13,"tag":59,"props":189,"children":191},{"id":190},"create-diagrams-and-flowcharts",[192],{"type":19,"value":193},"Create Diagrams and Flowcharts",{"type":13,"tag":21,"props":195,"children":196},{},[197],{"type":19,"value":198},"In the next step, you concentrate on the spatial relations of the objects on an abstract level so that you can later build the level based on these ideas. Diagrams help in communicating the relations in various ways and you're free to draw them on paper or with digital tools. There are many diagrams that are all collected and described here(link), but we would like to list some diagrams that might be especially helpful during this step:",{"type":13,"tag":170,"props":200,"children":201},{},[202,207],{"type":13,"tag":96,"props":203,"children":204},{},[205],{"type":19,"value":206},"Molecule Diagrams: These diagrams consist of nods that represent objects or spaces, and of edges representing the relations between the nodes. The nodes can be in a spatial relationship, describing which spaces a player can reach, or the edges can depict the significance the objects have for one another. The absence of edges is also a powerful tool of secribing what is not reachable for the player. (image and link)",{"type":13,"tag":96,"props":208,"children":209},{},[210],{"type":19,"value":211},"Proximity Diagrams: Same as molecule diagrams, proximity diagrams consist of nods and edges. In contrast to molecule diagrams, though, the size of the bubbles and lines are meaningful because they can either define the size of the spaces or, refering to the edges, the importance to the ajacence of the connected bubbles. (image and link)",{"type":13,"tag":21,"props":213,"children":214},{},[215],{"type":19,"value":216},"These diagrams can also be added to your reference collections and to your documentation.",{"type":13,"tag":59,"props":218,"children":220},{"id":219},"draw-a-map",[221],{"type":19,"value":222},"Draw a Map",{"type":13,"tag":21,"props":224,"children":225},{},[226],{"type":19,"value":227},"The idea behind drawing a map is getting an idea of how the level looks like. It is enough to roughly sketch the level and the level of detail is not important here, but can be varied based on your preference. Useful tools for drawing a map are simple non-digital sketches or digital drawing tools that you and your team are familiar with.\r\nAs in the above steps, these sketches can also be added to your documentation. (image)",{"type":13,"tag":59,"props":229,"children":231},{"id":230},"get-a-sense-of-space",[232],{"type":19,"value":131},{"type":13,"tag":21,"props":234,"children":235},{},[236],{"type":19,"value":237},"Since we put some time into abstract views and rough ideas, we will now move over to more concrete steps. It makes sense to get an idea of a space first by creating diagrams, but it gets exciting when finally building something that can be tested on a playable level. To get a quick view of your level, you can use your favorite engine where you can outline your planned level with a method that is called \"Whiteblocking\" (link). Place blocks for walls, obstacles and interactable objects to test your ideas-on-paper. It's not supposed to look pretty but rather just serve the purpose of quickly transfering your ideas to a concrete level. Finding issues as early as possible as well as getting to know the scale of your level is way easier with this method and saves you a lot of time after.\r\nHere are some engines that support whiteblocking:",{"type":13,"tag":170,"props":239,"children":240},{},[241,246],{"type":13,"tag":96,"props":242,"children":243},{},[244],{"type":19,"value":245},"Unity",{"type":13,"tag":96,"props":247,"children":248},{},[249],{"type":19,"value":250},"?",{"type":13,"tag":21,"props":252,"children":253},{},[254],{"type":19,"value":255},"(image)",{"type":13,"tag":59,"props":257,"children":259},{"id":258},"iterate-on-the-map",[260],{"type":19,"value":140},{"type":13,"tag":21,"props":262,"children":263},{},[264,266,271],{"type":19,"value":265},"Once you have your first digital, playable level and adjusted it to what's possible inside the engine, go back to your map from ",{"type":13,"tag":42,"props":267,"children":268},{"href":119},[269],{"type":19,"value":270},"step 3",{"type":19,"value":272}," and transfer the ajustments to the map. This iteration between the whiteblocked level and the map makes the level more concrete and more accurate in general, smoothing out rough edges and solving conceptual mistakes. It is still not the final map since you want to iterate over and over and also look for feedback within your team during the overall process.",{"type":13,"tag":59,"props":274,"children":276},{"id":275},"start-with-blockout",[277],{"type":19,"value":278},"Start with \"Blockout\"",{"type":13,"tag":21,"props":280,"children":281},{},[282],{"type":19,"value":283},"Blocking out is a technique where you move from simple whiteblocks to more concrete forms that will later symbolize concrete objects and obstacles. This is the step where you start your testing and iteration, since you become more and more detailed with every iteration. It is better to start simple and reduce your level to rough blocks first so that you know the dimensions, the spatial layout and the flow of your level. Playing with forms and objects can change the atmosphere and the Genius Loci(link) of your level as well as creating new challenges or opportunities for the player.",{"type":13,"tag":21,"props":285,"children":286},{},[287],{"type":19,"value":288},"It is important to get feedback as early as possible and include your team in decisions, so don't hesitate to ask them for their opinion and collaborate!",{"type":13,"tag":59,"props":290,"children":292},{"id":291},"iterate-over-the-last-steps-and-create-a-final-level",[293],{"type":19,"value":294},"Iterate over the last steps and create a final level",{"type":13,"tag":21,"props":296,"children":297},{},[298],{"type":19,"value":299},"Smoothly stepping into the last step, this is not the last step. It is rather a transition to the different stages of your level, starting from quick whiteblocking and moving on to more and more concrete blockouts that will eventually lead to the final version of the game.",{"type":13,"tag":21,"props":301,"children":302},{},[303],{"type":19,"value":304},"Below image shows one way of iterating through the steps. You may create a beta version where whiteblocks are already replaced by artwork and all the important gameplay is already implemented and ready to be tested by a defined amount of players to improve the final version by their feedback. You may also have all the gameplay ready before blocking out the whole level (an alpha version) before you finalize your level.",{"type":13,"tag":21,"props":306,"children":307},{},[308],{"type":19,"value":309},"However you would like to proceed with your iterations, it is important to include feedback into your process. Don't be afraid to make mistakes; rather learn from it.\r\n(image)",{"type":13,"tag":59,"props":311,"children":313},{"id":312},"see-also",[314],{"type":19,"value":315},"See also",{"type":13,"tag":21,"props":317,"children":318},{},[319],{"type":19,"value":320},"(Totten, 2019, p.17)",{"type":13,"tag":21,"props":322,"children":323},{},[324],{"type":19,"value":325},"(Alex K. @TychoBolt, 2020, p.9)",{"type":13,"tag":21,"props":327,"children":328},{},[329],{"type":19,"value":330},"Dyrda",{"type":13,"tag":21,"props":332,"children":333},{},[334],{"type":19,"value":335},"//Maybe make a checkbox system that closes the tab that you mark as completed",{"title":5,"searchDepth":337,"depth":337,"links":338},2,[339,340,341,342,343,344,345,346,347,348],{"id":61,"depth":337,"text":64},{"id":87,"depth":337,"text":90},{"id":161,"depth":337,"text":104},{"id":190,"depth":337,"text":193},{"id":219,"depth":337,"text":222},{"id":230,"depth":337,"text":131},{"id":258,"depth":337,"text":140},{"id":275,"depth":337,"text":278},{"id":291,"depth":337,"text":294},{"id":312,"depth":337,"text":315},"markdown","content:prototypingprocess.md","content","prototypingprocess.md","md",1687513649678]