{"_path":"/nondigitaltools","_dir":"","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Non-digital Tools (for Prototyping)","description":"There are tons of tools for making your own games, ranging from simple sketches drawn per hand to complex blocking techniques in your engine of choice. This page focuses on the various non-digital tools a striving level designer can use to make their life easier. Some of these tools are also used in processes regarding certain aspects of level design (as can be seen in the prototyping process for example), but all of them can  also be used as a stand-alone and addition to your planning and design process or game design document.","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"non-digital-tools-for-prototyping"},"children":[{"type":"text","value":"Non-digital Tools (for Prototyping)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There are tons of tools for making your own games, ranging from simple sketches drawn per hand to complex blocking techniques in your engine of choice. This page focuses on the various non-digital tools a striving level designer can use to make their life easier. Some of these tools are also used in processes regarding certain aspects of level design (as can be seen in the "},{"type":"element","tag":"a","props":{"href":"/prototypingprocess"},"children":[{"type":"text","value":"prototyping process"}]},{"type":"text","value":" for example), but all of them can  also be used as a stand-alone and addition to your planning and design process or game design document."}]},{"type":"element","tag":"h2","props":{"id":"collecting"},"children":[{"type":"text","value":"Collecting"}]},{"type":"element","tag":"h3","props":{"id":"reference-collections"},"children":[{"type":"text","value":"Reference Collections"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"References are an informal way of collecting anything remotely connected to the idea of your level. This can be colors, artwork, thoughts, pieces of literature, other games and many more media that gives you inspiration. They can be collected in designated folders, documents (e.g. Game Design Document) or non-digitally, and they can be shared with your team who can also contribute to the process of collecting references."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Examples of Tools used for reference collection are:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Any screenshot feature on your computer"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Color picker in a graphics editor (e.g. Photoshop) to collect distinct colors from an image"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Pureref (link to Pureref) (a tool to take notes in)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Examples of research sources are:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Physical books"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Games"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Reallife Art and Digital Art (e.g. Artstation, Deviantart)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Your own surroundings"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Image platforms (e.g. Pinterest)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Social Media (e.g. Instagram, TikTok)"}]}]},{"type":"element","tag":"h3","props":{"id":"mood-boards"},"children":[{"type":"text","value":"Mood Boards"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A mood board serves the same purpose as the reference collection, but there is more thought behind it other than just randomly collecting whatever inspires your level design. They are used by designers to communicate the idea on how the level should look like to other designers by collecting references that contribute to the overall mood, feeling and aesthetic of a game level. These mood boards don't have to be specific for the level, either - they can be used for the whole game and added to the game design document as a powerful tool to communicate and coordinate among the team. (Eckert & Stacey, 2003; Godlewsky, 2008, Endrissat et al., 2016)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It is important to note the balance of establishing a certain coordination while still maintaining the creative freedom of individual design. Coordination can be established by setting a theme and scene for the level, providing a direction for activities and a point of reference, while the creative freedom leaves room for interpretation and self expression in the choice of style."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There's no difference between the tools and sources used by mood boards and reference collections - every resource that is tangible in some way and can be documented can be added to the mood board as direction and inspiration tool (e.g. colors, games, books, art, sounds). In comparison to a reference collection, mood boards are more complete and clearer in their direction."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(images)"}]},{"type":"element","tag":"h2","props":{"id":"creating"},"children":[{"type":"text","value":"Creating"}]},{"type":"element","tag":"h3","props":{"id":"sketches-drawings"},"children":[{"type":"text","value":"Sketches & Drawings"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When you quickly want to pin down your own ideas, sketching comes in handy. (Totten, 2019) There's a reason that sketching and drawing has been practiced by humankind for so long, ranging from technical building sketches to forms of free, imaginative and abstract paintings. Ske.tches express your thoughts in a way that collections of references cannot since they are produced by you and your own mind. They can be rough sketches or detailed drawings depending on what you want to convey. Designers usually produce a large number of sketches in quick succession, often just abbreviations and improvements of the versions before. Since sketches can be easily talked about, it's a popular tool for communicating ideas and sharing them with your team."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As with the tools above, sketches and drawings can be saved in a folder and added to game design documents. Tools that can help you organizing your sketches are:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"A sketchbook"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Digital drawing tools (e.g. Photoshop, Procreate)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Additionally, here are some drawing types useful to level design:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Plan: A top-down drawing of a space that shows spatial relationships. Often used in apartment sketches. (image)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Section: A front view of an object or landscape, vertically cutting the visible objects and showing what's inside. (image)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Elevation: A front view of an object or landscape without the vertical cut, just showing the objects from outside. (image)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Axonometric: A vertical cut through spaces with 30 to 45 degrees angle view to show three-dimensionality of the space (image)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Perspective: Using perspective points to show \"how an object distorts based on the viewer's positioning\" (Totten, 2019, p.61). Usually used for concept art. (image)"}]}]},{"type":"element","tag":"h4","props":{"id":"parti-sketches"},"children":[{"type":"text","value":"Parti Sketches"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In Architecture, parti sketches are used to break down the buildings to its most integral parts. (Totten, 2019)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This is handy for game levels aswell, since it takes away all the additional information and brings the level architecture back to its roots. Designers can ask themselves if they can reduce the level to its most important core idea that can still be understood by players and collaborators. If it's your intend to give your level a clear direction, path or even red line that the player follows, it is a good idea to start sketching the core element (which can be a certain kind of architecture like a labyrinth or a straight path through obstacles) first and then building on this form to add to the level's uniqueness and variety."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The image above shows a good example of basic shapes that a level can be built on.\r\n(Totten, 2019, p.63 image)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These sketches don't have to be committed to and can be changed at any time. They also usually don't take measurements into account so that the designers can focus on the spatial relationships and forms of the level. (Totten, 2019)"}]},{"type":"element","tag":"h4","props":{"id":"sketches-with-measurement"},"children":[{"type":"text","value":"Sketches with Measurement"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you want a more close-to-reality sketch, try out graph paper. It's a paper with symmetric dots that can be seen as measurements units and help in creating a more linear sketch. Cartesian graph paper even has a regular grid with lines so that you don't have to use tools like rulers to draw straight lines. In level design, such sketches can  depict the dimensions of an object and a space while still maintaining a sufficient level of detail. However, if you're more interested in the basic forms, directions and the pacing of a level, you might want to refere to other tools like parti sketches or diagrams instead."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(image)"}]},{"type":"element","tag":"h3","props":{"id":"making-use-of-positive-and-negative-space"},"children":[{"type":"text","value":"Making Use of Positive and Negative Space"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Space is an important concept when you want to create a way to move through the space. As Totten says, \"positive space describes the area inhabited by the subject of a piece and negative space describes space outside of or in between subjects.\" (Totten, 2019, p.104-105) In other words, positive spaces are often describing objects, walls and the boundaries of a level while the player moves through the negative space between these objects. The designer has the freedom of choice in placing positive spaces in relation to negative space to create an interesting, unique and recognizable level."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(image)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Even three-dimensional objects can make use of positive and negative space by omitting or adding parts of their bodies to create a unique shape."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(image)"}]},{"type":"element","tag":"h3","props":{"id":"text"},"children":[{"type":"text","value":"Text"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Not only images help conveying your design ideas, but text in fact is often overlooked. One can express a lot with words and phrases, either passages from already written prosa or your own words. In game design documents, 90% of the content is written in text and conveys the vision of the designer."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Here are some inspirations where you can use text as a useful tool to design your level:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Passages from books, articles or any other written format that inspire you"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Quotes by famous people and movies"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Your own words written down to describe the aesthetic of a game"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"More technical descriptions in your game design document"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Writing journals summarizing your experiences and thoughts while playing other games"}]}]},{"type":"element","tag":"h2","props":{"id":"diagrams-and-graphs"},"children":[{"type":"text","value":"Diagrams and Graphs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Diagrams and graphs can be powerful tools to create a level. They are used for wayfinding but can also show how different objects are in relation with one another. Their shared methodology and synstax within the same group of graphs and diagrams also facilitates the communication and idea sharing between team members. There are different diagrams and graphs that are used by predefined processes (e.g. when you want to build your level with prototyping) but they can also be used as stand-alones. Whenever you finish a diagram, you can save them in a collection and add them to the game design document."}]},{"type":"element","tag":"h3","props":{"id":"euler-circles-and-venn-diagrams"},"children":[{"type":"text","value":"Euler Circles and Venn Diagrams"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Defining a relation between objects can be simple: You can start by drawing two circles that intersect with each other. The space of the intersection defines how the entities are connected while the circles enclose the entitties themselves. Even the space outside of the circle can be used to explain what the entities don't represent.\r\nThese circles are called Euler Circles and Venn Diagrams. If you want to have a detailed explanation Euler Circles and Venn Diagrams you can have a look at their respective Wikipedia entry (link). Most commonly they are used for describing colors and the intersection describes the color combinations."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(picture)"}]},{"type":"element","tag":"h3","props":{"id":"molecule-diagrams"},"children":[{"type":"text","value":"Molecule Diagrams"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A Molecule Diagram is where designers can start building their levels. It consists of Nodes, which represent the play spaces in one level, and Edges, which show the elationship between these spaces. This is an example of a Molecule Diagram:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(image with Arrive, Dungeon, Dungeon 2, Arena, p.502 in the slides)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In this diagram, the four playspaces the player can move in are represented by the four nodes while the edges show which spaces are connected to each other, hence describing the flow of the level."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By adding different variations of lines used in the Diagram you can easily establish a form of visual language that describes complex gamespaces. Here are a few suggestions by McMillan (quote):"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Dotted lines: Shows that one space can be seen from another space"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Arrows: Defines if the travel from one space to another is one-way, e.g. by blocking the way after the player transfered to the next gamespace"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Thick Lines: Describes direct ways between gamespaces that can be crossed multiple times"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After establishing an overview of the relation between the gamespaces, you can move on to actually draw your level. A translation of the previous example Molecule Diagram looks like this:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(image)"}]},{"type":"element","tag":"h3","props":{"id":"proximity-diagrams"},"children":[{"type":"text","value":"Proximity Diagrams"}]},{"type":"element","tag":"h3","props":{"id":"state-diagrams"},"children":[{"type":"text","value":"State Diagrams"}]},{"type":"element","tag":"h2","props":{"id":"graphs"},"children":[{"type":"text","value":"Graphs"}]},{"type":"element","tag":"h3","props":{"id":"higraphs"},"children":[{"type":"text","value":"Higraphs"}]},{"type":"element","tag":"h4","props":{"id":"hypergraphs"},"children":[{"type":"text","value":"Hypergraphs"}]},{"type":"element","tag":"h2","props":{"id":"maps"},"children":[{"type":"text","value":"Maps"}]},{"type":"element","tag":"h2","props":{"id":"see-also"},"children":[{"type":"text","value":"See also"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dyrda"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Adobe Photoshop"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pureref"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pinterest, Artstation, Deviantart"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Instagram, TikTok"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Totten, 2019"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"collecting","depth":2,"text":"Collecting","children":[{"id":"reference-collections","depth":3,"text":"Reference Collections"},{"id":"mood-boards","depth":3,"text":"Mood Boards"}]},{"id":"creating","depth":2,"text":"Creating","children":[{"id":"sketches-drawings","depth":3,"text":"Sketches & Drawings"},{"id":"making-use-of-positive-and-negative-space","depth":3,"text":"Making Use of Positive and Negative Space"},{"id":"text","depth":3,"text":"Text"}]},{"id":"diagrams-and-graphs","depth":2,"text":"Diagrams and Graphs","children":[{"id":"euler-circles-and-venn-diagrams","depth":3,"text":"Euler Circles and Venn Diagrams"},{"id":"molecule-diagrams","depth":3,"text":"Molecule Diagrams"},{"id":"proximity-diagrams","depth":3,"text":"Proximity Diagrams"},{"id":"state-diagrams","depth":3,"text":"State Diagrams"}]},{"id":"graphs","depth":2,"text":"Graphs","children":[{"id":"higraphs","depth":3,"text":"Higraphs"}]},{"id":"maps","depth":2,"text":"Maps"},{"id":"see-also","depth":2,"text":"See also"}]}},"_type":"markdown","_id":"content:nondigitaltools.md","_source":"content","_file":"nondigitaltools.md","_extension":"md"}